# Domus Semper Palingenesis — Brewfile
# Declarative Homebrew manifest for zero-touch bootstrap
# Source of truth: manifest.yaml (synced via tests/test-brewfile-sync.bats)
# Install: brew bundle [--file=~/.config/homebrew/Brewfile]

# ── Core tools ─────────────────────────────────────────────────────────────
brew "chezmoi"
brew "git"
brew "gh"
brew "neovim"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zoxide"
brew "starship"
brew "atuin"
brew "direnv"
brew "mise"

# ── Development ────────────────────────────────────────────────────────────
brew "jq"
brew "yq"
brew "just"
brew "lazygit"
brew "lazydocker"
brew "git-delta"
brew "git-absorb"
brew "git-filter-repo"
brew "git-gui"
brew "git-secrets"
brew "golangci-lint"
brew "llvm"
brew "nasm"
brew "opencode"
brew "procs"

# ── Development environments ──────────────────────────────────────────────
brew "go"
brew "rust"
brew "ruby"
brew "node"
brew "uv"
brew "pre-commit"
brew "python@3.11"
brew "python@3.13"
brew "python@3.14"

# ── DevOps & containers ──────────────────────────────────────────────────
brew "act"
brew "k9s"
brew "qemu"

# ── AI tools ──────────────────────────────────────────────────────────────
brew "block-goose-cli"
brew "gemini-cli"
brew "huggingface-cli"
brew "kimi-cli"
brew "github-mcp-server"
brew "ollama"

# ── Security & code quality ──────────────────────────────────────────────
brew "actionlint"
brew "gitleaks"
brew "ggshield"
brew "trivy"
brew "gnupg"
brew "git-lfs"
brew "shellcheck"
brew "shfmt"

# ── Media & files ─────────────────────────────────────────────────────────
brew "ffmpeg"
brew "rclone"
brew "qpdf"
brew "pillow"
brew "poppler"
brew "tesseract"

# ── Shell & terminal ─────────────────────────────────────────────────────
brew "bash"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fish"
brew "tmux"
brew "byobu"
brew "thefuck"
brew "carapace"

# ── Extras ────────────────────────────────────────────────────────────────
brew "bats-core"
brew "btop"
brew "coreutils"
brew "dropbox-uploader"
brew "duf"
brew "entr"
brew "fileicon"
brew "flavours"
brew "fresh-editor"
brew "fswatch"
brew "glow"
brew "gron"
brew "htop"
brew "hyperfine"
brew "lolcat"
brew "markdown"
brew "micro"
brew "navi"
brew "ncdu"
brew "pipx"
brew "progress"
brew "pv"
brew "tlrc"

# ── Casks ─────────────────────────────────────────────────────────────────
cask "kitty"
cask "1password-cli"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "warp"
cask "claude-code"
cask "codex"
cask "gcloud-cli"
cask "gitkraken-cli"
cask "block-goose"
cask "klatexformula"
cask "mailmate"
cask "ngrok"
cask "plugdata"
cask "font-jetbrains-mono-nerd-font"
